<a href="https://colab.research.google.com/github/feliperromao/datascience-na-pratica/blob/main/pandas_tratamento_dados_churn.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [20]:
import pandas as pd

## Carregando os dados

In [21]:
df = pd.read_csv("https://raw.githubusercontent.com/feliperromao/datascience-na-pratica/main/Churn.csv", sep=";")
df.shape

(999, 12)

## Analise exploratória e preparação dos dados
Ao visualizar os dados pela primeira vez percebemos que as colunas não estão com os nomes adequados

Vamos renomear as colunas

In [22]:
df.head()

   X0   X1  X2        X3  X4  X4.1        X6  X7  X8  X9         X10  X11
0   1  619  RS  Feminino  42     2         0   1   1   1  10134888.0    1
1   2  608  SC  Feminino  41     1   8380786   1   0   1  11254258.0    0
2   3  502  RS  Feminino  42     8   1596608   3   1   0  11393157.0    1
3   4  699  RS  Feminino  39     1         0   2   0   0   9382663.0    0
4   5  850  SC  Feminino  43     2  12551082   1   1   1    790841.0    0

### Renomeando as colunas e visualizando os dados

In [23]:
df.columns = ["id", "score", "estado", "genero", "idade", "patrimonio", "saldo", "produtos", "cartao-credito", "ativo", "salario", "saiu"]
df.head()

   id  score estado    genero  ...  cartao-credito  ativo     salario  saiu
0   1    619     RS  Feminino  ...               1      1  10134888.0     1
1   2    608     SC  Feminino  ...               0      1  11254258.0     0
2   3    502     RS  Feminino  ...               1      0  11393157.0     1
3   4    699     RS  Feminino  ...               0      0   9382663.0     0
4   5    850     SC  Feminino  ...               1      1    790841.0     0

[5 rows x 12 columns]

### Convertendo valores booleanos

In [25]:
df.loc[df["saiu"] == 1, "saiu"] = True
df.loc[df["saiu"] == 0, "saiu"] = False

df.loc[df["cartao-credito"] == 1, "cartao-credito"] = True
df.loc[df["cartao-credito"] == 0, "cartao-credito"] = False

df.loc[df["ativo"] == 1, "ativo"] = True
df.loc[df["ativo"] == 0, "ativo"] = False

In [26]:
df.head()

   id  score estado    genero  ...  cartao-credito  ativo     salario   saiu
0   1    619     RS  Feminino  ...            True   True  10134888.0   True
1   2    608     SC  Feminino  ...           False   True  11254258.0  False
2   3    502     RS  Feminino  ...            True  False  11393157.0   True
3   4    699     RS  Feminino  ...           False  False   9382663.0  False
4   5    850     SC  Feminino  ...            True   True    790841.0  False

[5 rows x 12 columns]

In [27]:
df.describe()

                id       score  ...    produtos       salario
count   999.000000  999.000000  ...  999.000000  9.920000e+02
mean    500.916917  648.621622  ...    1.526527  3.528762e+07
std     288.662884   98.264219  ...    0.574201  5.305800e+08
min       1.000000  376.000000  ...    1.000000  9.677000e+03
25%     251.500000  580.000000  ...    1.000000  3.029011e+06
50%     501.000000  653.000000  ...    1.000000  8.703250e+06
75%     750.500000  721.000000  ...    2.000000  1.405213e+07
max    1000.000000  850.000000  ...    4.000000  1.193469e+10

[8 rows x 7 columns]

## Explorando dados categoricos

### Analisando coluna `estado`

Nessa coluna podemos ver que existe dois valores que não correspondem a nenhum estado: `TD` e `RP`

Podemos observar tbm que temos o estado de `SP` cujo não faz parte da região que a empresa atende

De acordo com essa análise devemos substituir os valores de `TD`, `RP` e `SP` pelo valor da moda, que é `RS`

In [28]:
df.estado.value_counts()

RS    478
SC    258
PR    257
SP      4
TD      1
RP      1
Name: estado, dtype: int64